12/data/attachments/ecd280c36290df24.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_19249d94-f068-4de5-aefb-eeb0eb80a5e8</nif:username>
            <nif:friendToBeAdded>Nicole_kind_Friend_4650_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>